Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 25, 10)            640       
_________________________________________________________________
time_distributed (TimeDistri (None, 25, 1)             11        
=================================================================
Total params: 651
Trainable params: 651
Non-trainable params: 0
_________________________________________________________________
